src/cf/Documents/уатЗаявкаНаРасходованиеДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатЗаявкаНаРасходованиеДС</Name>
			<BasedOn>
				<xr:Item>Document.уатСчетНаОплатуПоставщика</xr:Item>
				<xr:Item>Document.уатПоступлениеТоваровУслуг</xr:Item>
				<xr:Item>Document.уатАвансовыйОтчет</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.уатЗаявкиНаРасходованиеДС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетКасса</Name>
					<Comment>Касса или банковский счет</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>Валюта документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>Вид операции</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.уатВидыОперацийЗаявкиНаРасходование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Comment>Дата входящего документа</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРасхода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Comment>Договор контрагента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ основание</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.уатАвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПоступлениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
						<v8:Type>cfg:CatalogRef.уатТипыТС</v8:Type>
						<v8:Type>cfg:CatalogRef.уатМоделиТС</v8:Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Comment>Номер входящего документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Comment>Основание</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодотчетноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приложение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятоОт</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйДокумент</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяОборотов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетСогласования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтавкаНДС</Name>
					<Comment>Ставка НДС</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатФормыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаПлатежа</Name>
					<Comment>Расшифровка платежа</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Comment>Договор контрагента</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КратностьВзаиморасчетов</Name>
							<Comment>Кратность взаиморасчетов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсВзаиморасчетов</Name>
							<Comment>Курс валюты взаиморасчетов по договору или валюты взаиморасчетов с подотчетником</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сделка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
								<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПоставщика</v8:Type>
								<v8:Type>cfg:DocumentRef.уатПоступлениеТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДвиженияДенежныхСредств</Name>
							<Comment>Статья движения денежных средств</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВзаиморасчетов</Name>
							<Comment>Сумма взаиморасчетов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Comment>Сумма платежа</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Enums/уатВидыОперацийЗаявкиНаРасходование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатВидыОперацийЗаявкиНаРасходование</Name>
			<Comment>Виды операций заявки на расходование (уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочийРасходДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчетыСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаПодотчетнику</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВедениеВзаиморасчетовПоДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВедениеВзаиморасчетовПоДоговорам</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоДоговоруВЦелом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСчетам</Name>
					<Comment>По счетам</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНакладным</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЗаказамНаТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДокументуАрендаТС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/уатЗаявкаНаРасходованиеДС/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	// Инициализация дополнительных свойств для проведения документа.
	уатПроведение.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	// Инициализация данных документа.
	Документы.уатЗаявкаНаРасходованиеДС.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	// Подготовка наборов записей.
	уатПроведение.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	уатПроведение_проф.ОтразитьЗаявкиНаРасходованиеДС(ДополнительныеСвойства, Движения, Отказ);
	
	// Запись наборов записей.
	уатПроведение.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль возникновения отрицательного остатка.
	Документы.уатЗаявкаНаРасходованиеДС.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
	
КонецПроцедуры // ОбработкаПроведения

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	МассивДоговоров = ЭтотОбъект.РасшифровкаПлатежа.ВыгрузитьКолонку("ДоговорКонтрагента");
	ТаблицаДоговоров = Новый таблицаЗначений;
	ТаблицаДоговоров.Колонки.Добавить("Договор");
	ТаблицаДоговоров.ЗагрузитьКолонку(МассивДоговоров,"Договор");
	ТаблицаДоговоров.Свернуть("Договор");
	
	Если ТаблицаДоговоров.Количество() = 1 Тогда
		ДоговорКонтрагента = ТаблицаДоговоров[0].Договор;
	Иначе
		ДоговорКонтрагента = Неопределено;
	КонецЕсли;
	
	// уатСогласованиеДокументов
	уатСогласованиеДокументовСервер.ПередЗаписью(ЭтотОбъект, РежимЗаписи, Отказ);
	// Конец уатСогласованиеДокументов
	
КонецПроцедуры // ПередЗаписью

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	уатПроведение.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	уатПроведение.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	уатПроведение.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль при отмене проведения не выполняем
	//Документы.уатЗаявкаНаРасходованиеДС.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ, Истина);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ РасшифровкаПлатежа.Итог("СуммаПлатежа") = СуммаДокумента Тогда
		ТекстНСТР = НСтр("en='Not the same amount of the document and its interpretation.';ru='Не совпадают сумма документа и ее расшифровка.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР,,,,Отказ);
	КонецЕсли;
	
	Если ВидОперации = Перечисления.уатВидыОперацийЗаявкиНаРасходование.ВыдачаПодотчетнику Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Контрагент"));
	Иначе
		Если ВидОперации = Перечисления.уатВидыОперацийЗаявкиНаРасходование.ПрочийРасходДенежныхСредств Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Контрагент"));
		КонецЕсли;
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ПодотчетноеЛицо"));
	КонецЕсли;
	
	Для Каждого Платеж Из РасшифровкаПлатежа Цикл
		
		// Сделка должна быть заполнена, если учет взаиморасчетов ведется по заказам.
		Если ЗначениеЗаполнено(Платеж.ДоговорКонтрагента) И НЕ ЗначениеЗаполнено(Платеж.Сделка) Тогда
			Если РасшифровкаПлатежа.Количество() > 1 Тогда
				Если Платеж.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам
					ИЛИ Платеж.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным
					ИЛИ Платеж.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС Тогда
					ТекстНСТР = СтрШаблон(НСтр("en='At line №%1 was not filled in attribute value ""Deal""';ru='В строке №%1 не заполнено значение реквизита ""Сделка""'"), Платеж.НомерСтроки);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР,,,,Отказ);
				КонецЕсли;
			Иначе
				Если Платеж.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
					ТекстНСТР = НСтр("en='Not completed requisite value ""Invoice""';ru='Не заполнено значение реквизита ""Счет на оплату""'");
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР,,,,Отказ);
				ИначеЕсли Платеж.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным Тогда
					ТекстНСТР = НСтр("en='Not completed requisite value ""Receipt""';ru='Не заполнено значение реквизита ""Поступление""'");
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР,,,,Отказ);
				ИначеЕсли Платеж.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС Тогда
					ТекстНСТР = НСтр("en='Not completed requisite value ""Order for trucking""';ru='Не заполнено значение реквизита ""Заказ на ТС""'");
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР,,,,Отказ);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Организация) И ЗначениеЗаполнено(Платеж.ДоговорКонтрагента) И Организация <> Платеж.ДоговорКонтрагента.Организация Тогда
			Если РасшифровкаПлатежа.Количество() = 1 Тогда
				ТекстНСТР = НСтр("en='Selected the contract of a counterparty, not corresponding to company specified in the document!';ru='Выбран договор контрагента, не соответствующий организации, указанной в документе!'");
			Иначе
				ТекстНСТР = СтрШаблон(НСтр("en='At line №%1 selected counterparty contract that does not match to company specified in document!';ru='В строке №%1 выбран договор контрагента, не соответствующий организации, указанной в документе!'"), Платеж.НомерСтроки);
			КонецЕсли;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР,,,,Отказ);
		КонецЕсли;
		
		Если ВидОперации = Перечисления.уатВидыОперацийЗаявкиНаРасходование.ОплатаПоставщику
			ИЛИ ВидОперации = Перечисления.уатВидыОперацийЗаявкиНаРасходование.ПрочиеРасчетыСКонтрагентами Тогда
			Если Не ЗначениеЗаполнено(Платеж.ДоговорКонтрагента) Тогда
				Если РасшифровкаПлатежа.Количество() = 1 Тогда
					ТекстНСТР = НСтр("en='Counterparty contract not filled!';ru='Не заполнен договор контрагента!'");
				Иначе
					ТекстНСТР = СтрШаблон(НСтр("en='At line №%1 is not fill counterparty contract!';ru='В строке №%1 не заполнен договор контрагента!'"), Платеж.НомерСтроки);
				КонецЕсли;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР,,,,Отказ);
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Платеж.СуммаПлатежа) Тогда
				Если РасшифровкаПлатежа.Количество() = 1 Тогда
					ТекстНСТР = НСтр("en='Sum is not filled!';ru='Не заполнена сумма!'");
				Иначе
					ТекстНСТР = СтрШаблон(НСтр("en='In line №%1 was not filled sum!';ru='В строке №%1 не заполнена сумма!'"), Платеж.НомерСтроки);
				КонецЕсли;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР,,,,Отказ);
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Платеж.ДоговорКонтрагента) И Платеж.ДоговорКонтрагента.ВалютаВзаиморасчетов <> ВалютаДокумента Тогда
			ТекстНСТР = НСтр("en='In line № ""%1"" currency of counterparty contract is different from currency of document!';ru='В строке № ""%1"" валюта договора контрагента отличается от валюты документа!'");
			ТекстНСТР = СтрШаблон(ТекстНСТР, Платеж.НомерСтроки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР,,,,Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	уатОбщегоНазначенияСервер.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	уатОбщегоНазначенияТиповые.ЗаполнитьШапкуДокумента(ЭтотОбъект, ПользователиКлиентСервер.АвторизованныйПользователь());
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатПоступлениеТоваровУслуг") Тогда
		Если ДанныеЗаполнения.ОплатаПодотчетнымЛицом Тогда
			ВидОперации     = Перечисления.уатВидыОперацийЗаявкиНаРасходование.ВыдачаПодотчетнику;
			ПодотчетноеЛицо = ДанныеЗаполнения.ПодотчетноеЛицо;
		Иначе
			ВидОперации     = Перечисления.уатВидыОперацийЗаявкиНаРасходование.ОплатаПоставщику;
		КонецЕсли;
		Основание           = ДанныеЗаполнения;
		ДокументОснование   = ДанныеЗаполнения;
		Контрагент          = ДанныеЗаполнения.Контрагент;
		ДоговорКонтрагента  = ДанныеЗаполнения.ДоговорКонтрагента;
		ВалютаДокумента     = ДанныеЗаполнения.ДоговорКонтрагента.ВалютаВзаиморасчетов;
		Организация         = ДанныеЗаполнения.Организация;
		Комментарий         = ДанныеЗаполнения.Комментарий;
		
		Если ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента Тогда
			КурсДокумента = ДанныеЗаполнения.КурсВзаиморасчетов;
			КратностьДокумента = ДанныеЗаполнения.КратностьВзаиморасчетов;
		Иначе
			ВалютаДокументаКурсКратность = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(ВалютаДокумента, ТекущаяДата(),
				ЭтотОбъект);
			КурсДокумента     = ВалютаДокументаКурсКратность.Курс;
			КратностьДокумента = ВалютаДокументаКурсКратность.Кратность;
		КонецЕсли;
		
		флСуммаНеВключаетНДС = (ДанныеЗаполнения.УчитыватьНДС И НЕ ДанныеЗаполнения.СуммаВключаетНДС);
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	уатПоступлениеТоваровУслугТовары.Ссылка.ВалютаДокумента КАК Валюта,
		|	ЗНАЧЕНИЕ(Документ.уатЗаказГрузоотправителя.ПустаяСсылка) КАК ЗаказНаТС,
		|	уатПоступлениеТоваровУслугТовары.Сумма КАК Сумма,
		|	уатПоступлениеТоваровУслугТовары.СуммаНДС КАК СуммаНДС,
		|	уатПоступлениеТоваровУслугТовары.Сумма КАК СуммаВалютная,
		|	уатПоступлениеТоваровУслугТовары.СуммаНДС КАК СуммаНДСвалютная
		|ИЗ
		|	Документ.уатПоступлениеТоваровУслуг.Товары КАК уатПоступлениеТоваровУслугТовары
		|ГДЕ
		|	уатПоступлениеТоваровУслугТовары.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	уатПоступлениеТоваровУслугУслуги.Валюта,
		|	уатПоступлениеТоваровУслугУслуги.ЗаказНаТС,
		|	уатПоступлениеТоваровУслугУслуги.Сумма,
		|	уатПоступлениеТоваровУслугУслуги.СуммаНДС,
		|	уатПоступлениеТоваровУслугУслуги.СуммаВалютная,
		|	уатПоступлениеТоваровУслугУслуги.СуммаНДСвалютная
		|ИЗ
		|	Документ.уатПоступлениеТоваровУслуг.Услуги КАК уатПоступлениеТоваровУслугУслуги
		|ГДЕ
		|	уатПоступлениеТоваровУслугУслуги.Ссылка = &Ссылка");
		
		Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
		тблДанные = Запрос.Выполнить().Выгрузить();
		
		Для Каждого ТекСтрока Из тблДанные Цикл
			НоваяСтрока = РасшифровкаПлатежа.Добавить();
			НоваяСтрока.ДоговорКонтрагента = ДанныеЗаполнения.ДоговорКонтрагента;
			
			Если ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС Тогда
				НоваяСтрока.Сделка = ТекСтрока.ЗаказНаТС;
			Иначе
				Если ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным Тогда
					НоваяСтрока.Сделка = ДанныеЗаполнения;
				Иначе
					НоваяСтрока.Сделка = ДанныеЗаполнения.Сделка;
				КонецЕсли;
			КонецЕсли;
			
			Если ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента Тогда
				НоваяСтрока.СуммаПлатежа = ТекСтрока.Сумма + ?(флСуммаНеВключаетНДС, ТекСтрока.СуммаНДС, 0);
			ИначеЕсли ВалютаДокумента = ТекСтрока.Валюта Тогда
				НоваяСтрока.СуммаПлатежа = ТекСтрока.СуммаВалютная + ?(флСуммаНеВключаетНДС, ТекСтрока.СуммаНДСВалютная, 0);
			Иначе
				СуммаСтроки = ТекСтрока.Сумма + ?(флСуммаНеВключаетНДС, ТекСтрока.СуммаНДС, 0);
				НоваяСтрока.СуммаПлатежа = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(СуммаСтроки,
					ДанныеЗаполнения.ВалютаДокумента,         ВалютаДокумента,
					ДанныеЗаполнения.КурсВзаиморасчетов,      КурсДокумента,
					ДанныеЗаполнения.КратностьВзаиморасчетов, КратностьДокумента,,
					ЭтотОбъект);
			КонецЕсли;
			
			НоваяСтрока.КурсВзаиморасчетов      = КурсДокумента;
			НоваяСтрока.КратностьВзаиморасчетов = КратностьДокумента;
		КонецЦикла;
		
		РасшифровкаПлатежа.Свернуть("ДоговорКонтрагента, Сделка, КурсВзаиморасчетов, КратностьВзаиморасчетов, СтатьяДвиженияДенежныхСредств",
			"СуммаПлатежа");
		 
		СуммаДокумента = РасшифровкаПлатежа.Итог("СуммаПлатежа");
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатСчетНаОплатуПоставщика") Тогда
		ВидОперации         = Перечисления.уатВидыОперацийЗаявкиНаРасходование.ОплатаПоставщику;
		Основание           = ДанныеЗаполнения;
		ДокументОснование   = ДанныеЗаполнения;
		Контрагент          = ДанныеЗаполнения.Контрагент;
		ДоговорКонтрагента  = ДанныеЗаполнения.ДоговорКонтрагента;
		ВалютаДокумента     = ДанныеЗаполнения.ДоговорКонтрагента.ВалютаВзаиморасчетов;
		Организация         = ДанныеЗаполнения.Организация;
		Комментарий         = ДанныеЗаполнения.Комментарий;
		
		Если ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента Тогда
			КурсДокумента = ДанныеЗаполнения.КурсВзаиморасчетов;
			КратностьДокумента = ДанныеЗаполнения.КратностьВзаиморасчетов;
		Иначе
			ВалютаДокументаКурсКратность = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(ВалютаДокумента, ТекущаяДата(),
				ЭтотОбъект);
			КурсДокумента     = ВалютаДокументаКурсКратность.Курс;
			КратностьДокумента = ВалютаДокументаКурсКратность.Кратность;
		КонецЕсли;
		
		флСуммаНеВключаетНДС = (ДанныеЗаполнения.УчитыватьНДС И НЕ ДанныеЗаполнения.СуммаВключаетНДС);
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	уатСчетНаОплатуПоставщикаТовары.Ссылка.ВалютаДокумента КАК Валюта,
		|	ЗНАЧЕНИЕ(Документ.уатЗаказГрузоотправителя.ПустаяСсылка) КАК ЗаказНаТС,
		|	уатСчетНаОплатуПоставщикаТовары.Сумма КАК Сумма,
		|	уатСчетНаОплатуПоставщикаТовары.СуммаНДС КАК СуммаНДС,
		|	уатСчетНаОплатуПоставщикаТовары.Сумма КАК СуммаВалютная,
		|	уатСчетНаОплатуПоставщикаТовары.СуммаНДС КАК СуммаНДСвалютная
		|ИЗ
		|	Документ.уатСчетНаОплатуПоставщика.Товары КАК уатСчетНаОплатуПоставщикаТовары
		|ГДЕ
		|	уатСчетНаОплатуПоставщикаТовары.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	уатСчетНаОплатуПоставщикаУслуги.Валюта,
		|	уатСчетНаОплатуПоставщикаУслуги.ЗаказНаТС,
		|	уатСчетНаОплатуПоставщикаУслуги.Сумма,
		|	уатСчетНаОплатуПоставщикаУслуги.СуммаНДС,
		|	уатСчетНаОплатуПоставщикаУслуги.СуммаВалютная,
		|	уатСчетНаОплатуПоставщикаУслуги.СуммаНДСвалютная
		|ИЗ
		|	Документ.уатСчетНаОплатуПоставщика.Услуги КАК уатСчетНаОплатуПоставщикаУслуги
		|ГДЕ
		|	уатСчетНаОплатуПоставщикаУслуги.Ссылка = &Ссылка");
		
		Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
		тблДанные = Запрос.Выполнить().Выгрузить();
		
		Для Каждого ТекСтрока Из тблДанные Цикл
			НоваяСтрока = РасшифровкаПлатежа.Добавить();
			НоваяСтрока.ДоговорКонтрагента = ДанныеЗаполнения.ДоговорКонтрагента;
			
			Если ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС Тогда
				НоваяСтрока.Сделка = ТекСтрока.ЗаказНаТС;
			Иначе
				Если ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
					НоваяСтрока.Сделка = ДанныеЗаполнения;
				КонецЕсли;
			КонецЕсли;
			
			Если ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента Тогда
				НоваяСтрока.СуммаПлатежа = ТекСтрока.Сумма + ?(флСуммаНеВключаетНДС, ТекСтрока.СуммаНДС, 0);
			ИначеЕсли ВалютаДокумента = ТекСтрока.Валюта Тогда
				НоваяСтрока.СуммаПлатежа = ТекСтрока.СуммаВалютная + ?(флСуммаНеВключаетНДС, ТекСтрока.СуммаНДСВалютная, 0);
			Иначе
				СуммаСтроки = ТекСтрока.Сумма + ?(флСуммаНеВключаетНДС, ТекСтрока.СуммаНДС, 0);
				НоваяСтрока.СуммаПлатежа = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(СуммаСтроки,
					ДанныеЗаполнения.ВалютаДокумента,         ВалютаДокумента,
					ДанныеЗаполнения.КурсВзаиморасчетов,      КурсДокумента,
					ДанныеЗаполнения.КратностьВзаиморасчетов, КратностьДокумента,,
					ЭтотОбъект);
			КонецЕсли;
			
			НоваяСтрока.КурсВзаиморасчетов      = КурсДокумента;
			НоваяСтрока.КратностьВзаиморасчетов = КратностьДокумента;
		КонецЦикла;
		
		РасшифровкаПлатежа.Свернуть("ДоговорКонтрагента, Сделка, КурсВзаиморасчетов, КратностьВзаиморасчетов, СтатьяДвиженияДенежныхСредств",
			"СуммаПлатежа");
		 
		СуммаДокумента = РасшифровкаПлатежа.Итог("СуммаПлатежа");
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатАвансовыйОтчет") Тогда
		ВидОперации         = Перечисления.уатВидыОперацийЗаявкиНаРасходование.ВыдачаПодотчетнику;
		Основание           = ДанныеЗаполнения;
		ДокументОснование   = ДанныеЗаполнения;
		ПодотчетноеЛицо     = ДанныеЗаполнения.ПодотчетноеЛицо;
		ВалютаДокумента     = ДанныеЗаполнения.ВалютаДокумента;
		КурсДокумента       = ДанныеЗаполнения.Курс;
		КратностьДокумента  = ДанныеЗаполнения.Кратность;
		Организация         = ДанныеЗаполнения.Организация;
		Комментарий         = ДанныеЗаполнения.Комментарий;
				
		флСуммаНеВключаетНДС = (ДанныеЗаполнения.УчитыватьНДС И НЕ ДанныеЗаполнения.СуммаВключаетНДС);
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	уатАвансовыйОтчетМатериалы.Ссылка.ВалютаДокумента КАК Валюта,
		|	уатАвансовыйОтчетМатериалы.Сумма КАК Сумма,
		|	уатАвансовыйОтчетМатериалы.СуммаНДС КАК СуммаНДС,
		|	уатАвансовыйОтчетМатериалы.Сумма КАК СуммаВалютная,
		|	уатАвансовыйОтчетМатериалы.СуммаНДС КАК СуммаНДСвалютная,
		|	уатАвансовыйОтчетМатериалы.Ссылка.Курс КАК Курс,
		|	уатАвансовыйОтчетМатериалы.Ссылка.Кратность КАК Кратность
		|ИЗ
		|	Документ.уатАвансовыйОтчет.Материалы КАК уатАвансовыйОтчетМатериалы
		|ГДЕ
		|	уатАвансовыйОтчетМатериалы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	уатАвансовыйОтчетРасходы.Валюта,
		|	уатАвансовыйОтчетРасходы.Сумма,
		|	уатАвансовыйОтчетРасходы.СуммаНДС,
		|	уатАвансовыйОтчетРасходы.Сумма,
		|	уатАвансовыйОтчетРасходы.СуммаНДС,
		|	уатАвансовыйОтчетРасходы.Курс,
		|	уатАвансовыйОтчетРасходы.Кратность
		|ИЗ
		|	Документ.уатАвансовыйОтчет.Расходы КАК уатАвансовыйОтчетРасходы
		|ГДЕ
		|	уатАвансовыйОтчетРасходы.Ссылка = &Ссылка");
		
		Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
		тблДанные = Запрос.Выполнить().Выгрузить();
		
		Для Каждого ТекСтрока Из тблДанные Цикл
			НоваяСтрока = РасшифровкаПлатежа.Добавить();
			
			Если ТекСтрока.Валюта = ВалютаДокумента Тогда
				НоваяСтрока.СуммаПлатежа = ТекСтрока.Сумма + ?(флСуммаНеВключаетНДС, ТекСтрока.СуммаНДС, 0);
			Иначе
				СуммаСтроки = ТекСтрока.Сумма + ?(флСуммаНеВключаетНДС, ТекСтрока.СуммаНДС, 0);
				НоваяСтрока.СуммаПлатежа = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(СуммаСтроки,
					ТекСтрока.Валюта,    ВалютаДокумента,
					ТекСтрока.Курс,      КурсДокумента,
					ТекСтрока.Кратность, КратностьДокумента,,
					ЭтотОбъект);
			КонецЕсли;
		КонецЦикла;
		
		РасшифровкаПлатежа.Свернуть("СтатьяДвиженияДенежныхСредств", "СуммаПлатежа");
		СуммаДокумента = РасшифровкаПлатежа.Итог("СуммаПлатежа");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
